app/Http/Controllers/SarjaController.php

    public function edit($id)
    {
        // Viedään kirjat lisättäväksi
        $teos = Teos::orderBy('suominimi')->get();
---
select * from `teos` order by `suominimi` asc

    public function add(Request $request, $idSarja, $idTeos)
    {
        $this->validate(
            $request,
            [
                'nimi' => 'required' // Jos alkupe-nimi ei ole täytetty, palataan takaisin sivulle ja näytetään virhe
            ]
        );
        // Haetaan sarja
        $sarja = sarja::find($idSarja);

        // Haetaan kirjat
        $teos = Teos::find($idTeos);
        // Tehdään merkintä kirjoista sarjassa pivot tauluun
        $sarja->teos()->attach($teos);
---
insert into `sarja_teos` (`sarja_id`, `teos_id`) values (1, 2)